# При отправке кода на Выполнение раскомментируйте строки ниже, чтобы задать значения аргументов и выполнить код.
# При отправке решения на Проверку закомментируйте эти строки обратно - система автоматически подставит разные значения аргументов и проверит ваш код.

first_number = 10
second_number = 20
sum_number = 30

# Введите ваше решение ниже
print('Сколько будет', first_number, '+', second_number, '?')
result1 = int(input('Введите правильный ответ.'))
if result1 == sum_number:
    print('Ответ верный!')
else:
    print('Ответ неверный!')
    print('Правильный результат: 30')

