# Задача 6. «Война и мир» Что нужно сделать Мало кто не знает знаменитый роман Л. Н. Толстого «Война и мир». Это
# довольно объёмное произведение лежит в архиве voina-i-mir.zip. Напишите программу, которая подсчитывает статистику
# по буквам (не только русского алфавита) в этом романе и выводит результат на экран (или в файл). Результат должен
# быть отсортирован по частоте встречаемости букв (по возрастанию или убыванию). Регистр символов имеет значение.
#
# Архив можно распаковать вручную, но, если хотите, можете изучить документацию по модулю zipfile (можно использовать
# и другой модуль) и попробовать написать код, который будет распаковывать архив за вас.
