# Задача 3. Файлы и папки Что нужно сделать Напишите программу, которая получает на вход путь до каталога (в том
# числе это может быть просто корень диска) и выводит общее количество файлов и подкаталогов в нём. Также выведите на
# экран размер каталога в килобайтах (1 килобайт = 1024 байт).
#
# Важный момент: чтобы посчитать, сколько весит каталог, нужно найти сумму размеров всех вложенных в него файлов.
#
# Результат работы программы на примере python_basic\Module14:
#
# E:\PycharmProjects\python_basic\Module14
#
# Размер каталога (в Кбайтах): 8.373046875
#
# Количество подкаталогов: 7
#
# Количество файлов: 15

import os

