# При отправке кода на Выполнение раскомментируйте строку ниже, чтобы задать значения аргументов и выполнить код. При отправке решения на Проверку закомментируйте эту строку обратно - система автоматически подставит разные значения аргументов и проверит ваш код.

money = 50
cheese_price = 60
ice_cream_price = 20

# Введите ваше решение ниже

# if money >= cheese_price:
#     print('На сыр денег хватило')
#     money -= cheese_price
#     if money >= ice_cream_price:
#         print('И на мороженое тоже!')
#     elif money < ice_cream_price:
#         print('Денег маловато')
# else:
#     print('Денег не хватило даже на сыр!')












