print('Задача 5. Маятник ')

# Известно, что амплитуда качающегося маятника с каждым разом затухает
# на 8,4% от амплитуды прошлого колебания.
# Если качнуть маятник,
# то, строго говоря, он не остановится никогда,
# просто амплитуда будет постоянно уменьшаться до тех пор,
# пока мы не сочтём такой маятник остановившимся.

# Напишите программу,
# определяющую, сколько раз качнётся маятник, прежде чем он, по нашему мнению, остановится.

# Программа получает на вход
# начальную амплитуду колебания в сантиметрах
# и конечную амплитуду его колебаний,
# которая считается остановкой маятника.

# Обеспечьте контроль ввода.

# Пример:

# Введите начальную амплитуду: 1
# Введите амплитуду остановки: 0.1

# Маятник считается остановившимся через 27 колебаний

amplitude = float(input('Введите начальную амплитуду: '))
amplitude_stop = float(input('Введите амплитуду остановки: '))


def amp(damping):
    stop = 1
    stopping = 0
    damping = 8.4 / 100
    while stop > damping:
        stop *= 1 - damping
    stopping += 1

    print(f'Маятник считается остановившимся через {stopping} колебаний')


amp(amplitude_stop)
